# 1 Strokes data  -bring and explore

In [1]:
ls

 Volume in drive C has no label.
 Volume Serial Number is EA54-6392

 Directory of C:\Users\Krop\Documents\Ironhack\LabsCamp\IronPau\w1day3

13/04/2022  12:04    <DIR>          .
13/04/2022  12:04    <DIR>          ..
13/04/2022  11:24                 7 .gitignore
13/04/2022  11:28    <DIR>          .ipynb_checkpoints
16/10/2020  12:35    <DIR>          csv_files
13/04/2022  09:51         2,635,787 strokes_data.csv
13/04/2022  12:04            35,395 Strokes-initial.ipynb
               3 File(s)      2,671,189 bytes
               4 Dir(s)  777,007,005,696 bytes free

In [2]:
pwd

'C:\\Users\\Krop\\Documents\\Ironhack\\LabsCamp\\IronPau\\w1day3'

In [3]:
import pandas as pd
strokes = pd.read_csv('strokes_data.csv')

In [4]:
strokes

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,30669,Male,3.0,0,0,No,children,Rural,95.12,18.0,NaN,0
1,30468,Male,58.0,1,0,Yes,Private,Urban,87.96,39.2,never smoked,0
2,16523,Female,8.0,0,0,No,Private,Urban,110.89,17.6,NaN,0
3,56543,Female,70.0,0,0,Yes,Private,Rural,69.04,35.9,formerly smoked,0
4,46136,Male,14.0,0,0,No,Never_worked,Rural,161.28,19.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...
43395,56196,Female,10.0,0,0,No,children,Urban,58.64,20.4,never smoked,0
43396,5450,Female,56.0,0,0,Yes,Govt_job,Urban,213.61,55.4,formerly smoked,0
43397,28375,Female,82.0,1,0,Yes,Private,Urban,91.94,28.9,formerly smoked,0
43398,27973,Male,40.0,0,0,Yes,Private,Urban,99.16,33.2,never smoked,0
43399,36271,Female,82.0,0,0,Yes,Private,Urban,79.48,20.6,never smoked,0

In [5]:
# whats in the data - how many nulls
strokes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43400 entries, 0 to 43399
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 43400 non-null  int64
 1   gender             43400 non-null  object
 2   age                43400 non-null  float64
 3   hypertension       43400 non-null  int64
 4   heart_disease      43400 non-null  int64
 5   ever_married       43400 non-null  object
 6   work_type          43400 non-null  object
 7   Residence_type     43400 non-null  object
 8   avg_glucose_level  43400 non-null  float64
 9   bmi                41938 non-null  float64
 10  smoking_status     30108 non-null  object
 11  stroke             43400 non-null  int64
dtypes: float64(3), int64(4), object(5)
memory usage: 4.0+ MB

In [6]:
strokes.describe()

,id,age,hypertension,heart_disease,avg_glucose_level,bmi,stroke
count,43400.000000,43400.000000,43400.000000,43400.000000,43400.000000,41938.000000,43400.000000
mean,36326.142350,42.217894,0.093571,0.047512,104.482750,28.605038,0.018041
std,21072.134879,22.519649,0.291235,0.212733,43.111751,7.770020,0.133103
min,1.000000,0.080000,0.000000,0.000000,55.000000,10.100000,0.000000
25%,18038.500000,24.000000,0.000000,0.000000,77.540000,23.200000,0.000000
50%,36351.500000,44.000000,0.000000,0.000000,91.580000,27.700000,0.000000
75%,54514.250000,60.000000,0.000000,0.000000,112.070000,32.900000,0.000000
max,72943.000000,82.000000,1.000000,1.000000,291.050000,97.600000,1.000000

In [7]:
strokes["gender"].unique()

array(['Male', 'Female', 'Other'], dtype=object)

In [8]:
strokes["gender"].value_counts()

Female    25665
Male      17724
Other        11
Name: gender, dtype: int64

In [9]:
strokes["smoking_status"]

0                    NaN
1           never smoked
2                    NaN
3        formerly smoked
4                    NaN
              ...
43395       never smoked
43396    formerly smoked
43397    formerly smoked
43398       never smoked
43399       never smoked
Name: smoking_status, Length: 43400, dtype: object

In [10]:
#identify duplication

strokes.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
43395    False
43396    False
43397    False
43398    False
43399    False
Length: 43400, dtype: bool

In [11]:
#lets try find the duplicates on id
strokes.duplicated(subset=['id'])

0        False
1        False
2        False
3        False
4        False
         ...
43395    False
43396    False
43397    False
43398    False
43399    False
Length: 43400, dtype: bool

In [12]:
strokes["id"]

0        30669
1        30468
2        16523
3        56543
4        46136
         ...
43395    56196
43396     5450
43397    28375
43398    27973
43399    36271
Name: id, Length: 43400, dtype: int64

In [13]:
duplicate_id = strokes[strokes["id"].duplicated() == True]
duplicate_id

Empty DataFrame
Columns: [id, gender, age, hypertension, heart_disease, ever_married, work_type, Residence_type, avg_glucose_level, bmi, smoking_status, stroke]
Index: []

In [14]:
strokes.duplicated(subset=['id']).value_counts()

False    43400
dtype: int64

In [15]:
strokes.duplicated(subset = 'id').sum()

0

In [16]:
strokes.duplicated().value_counts()

False    43400
dtype: int64

# 1.1 Changing data types

- lets change the id from int to str (object)
- lets change from int to boolean

In [17]:
#change we change the type of th column id
strokes["id"] = strokes["id"].astype("str")
strokes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43400 entries, 0 to 43399
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 43400 non-null  object
 1   gender             43400 non-null  object
 2   age                43400 non-null  float64
 3   hypertension       43400 non-null  int64
 4   heart_disease      43400 non-null  int64
 5   ever_married       43400 non-null  object
 6   work_type          43400 non-null  object
 7   Residence_type     43400 non-null  object
 8   avg_glucose_level  43400 non-null  float64
 9   bmi                41938 non-null  float64
 10  smoking_status     30108 non-null  object
 11  stroke             43400 non-null  int64
dtypes: float64(3), int64(3), object(6)
memory usage: 4.0+ MB

#we make a new column to store heart_disease as bool
strokes['heart_disease_bool'] = strokes['heart_disease'].astype('bool')
strokes.info()

In [18]:
strokes['heart_disease'] = strokes['heart_disease'].astype('bool')
strokes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43400 entries, 0 to 43399
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 43400 non-null  object
 1   gender             43400 non-null  object
 2   age                43400 non-null  float64
 3   hypertension       43400 non-null  int64
 4   heart_disease      43400 non-null  bool
 5   ever_married       43400 non-null  object
 6   work_type          43400 non-null  object
 7   Residence_type     43400 non-null  object
 8   avg_glucose_level  43400 non-null  float64
 9   bmi                41938 non-null  float64
 10  smoking_status     30108 non-null  object
 11  stroke             43400 non-null  int64
dtypes: bool(1), float64(3), int64(2), object(6)
memory usage: 3.7+ MB

#python dictionaries
() in pandas bunch of variables etc
[] list
{} dictionary - key + value


Now for ever_married we want to replace:
 no :0
 yes : 1

strokes_new = strokes
strokes_new['ever_married'] = strokes_new['ever_married'].replace({'No':False , 'Yes':True})
strokes_new['ever_married']

strokes_new.info()

#strokes = strokes_new

create 3 data frames
- df1 rows 1- 1000
- df2 rows 1001- 3500
- df3 rest of rows

#creating 3 dataframes form the original
df1 = 
df2 =
df3 =

In [21]:
strokes.head(2) #index begins at 0

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,30669,Male,3.0,0,False,No,children,Rural,95.12,18.0,NaN,0
1,30468,Male,58.0,1,False,Yes,Private,Urban,87.96,39.2,never smoked,0

In [22]:
strokes[1:3] # testing slicing

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
1,30468,Male,58.0,1,False,Yes,Private,Urban,87.96,39.2,never smoked,0
2,16523,Female,8.0,0,False,No,Private,Urban,110.89,17.6,NaN,0

In [23]:
#creating 3 dataframes form the original
df1 = strokes.iloc[:1000]
# df1 = strokes[:1000] #would work also
df2 = strokes.iloc[1000:3500]
df3 = strokes.iloc[3500:]

In [24]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 1000 non-null   object
 1   gender             1000 non-null   object
 2   age                1000 non-null   float64
 3   hypertension       1000 non-null   int64
 4   heart_disease      1000 non-null   bool
 5   ever_married       1000 non-null   object
 6   work_type          1000 non-null   object
 7   Residence_type     1000 non-null   object
 8   avg_glucose_level  1000 non-null   float64
 9   bmi                973 non-null    float64
 10  smoking_status     711 non-null    object
 11  stroke             1000 non-null   int64
dtypes: bool(1), float64(3), int64(2), object(6)
memory usage: 87.0+ KB

In [25]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2500 entries, 1000 to 3499
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 2500 non-null   object
 1   gender             2500 non-null   object
 2   age                2500 non-null   float64
 3   hypertension       2500 non-null   int64
 4   heart_disease      2500 non-null   bool
 5   ever_married       2500 non-null   object
 6   work_type          2500 non-null   object
 7   Residence_type     2500 non-null   object
 8   avg_glucose_level  2500 non-null   float64
 9   bmi                2391 non-null   float64
 10  smoking_status     1729 non-null   object
 11  stroke             2500 non-null   int64
dtypes: bool(1), float64(3), int64(2), object(6)
memory usage: 217.4+ KB

In [26]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39900 entries, 3500 to 43399
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 39900 non-null  object
 1   gender             39900 non-null  object
 2   age                39900 non-null  float64
 3   hypertension       39900 non-null  int64
 4   heart_disease      39900 non-null  bool
 5   ever_married       39900 non-null  object
 6   work_type          39900 non-null  object
 7   Residence_type     39900 non-null  object
 8   avg_glucose_level  39900 non-null  float64
 9   bmi                38574 non-null  float64
 10  smoking_status     27668 non-null  object
 11  stroke             39900 non-null  int64
dtypes: bool(1), float64(3), int64(2), object(6)
memory usage: 3.4+ MB

In [27]:
#df2.head() #lets try reset the index
df2.reset_index(drop=True, inplace=True) # this will reset the index |Not creating another column  and working over df2

In [28]:
df2.head()

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,69355,Male,3.0,0,False,No,children,Rural,86.38,22.8,NaN,0
1,5858,Male,32.0,0,False,No,Private,Rural,93.68,31.4,never smoked,0
2,39823,Female,41.0,0,False,Yes,Govt_job,Rural,229.86,35.2,smokes,0
3,37053,Male,53.0,0,False,Yes,Govt_job,Rural,78.73,23.3,never smoked,0
4,2082,Male,35.0,0,False,Yes,Private,Rural,115.92,NaN,formerly smoked,0

In [30]:
df3.reset_index(drop=True, inplace=True)
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39900 entries, 0 to 39899
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 39900 non-null  object
 1   gender             39900 non-null  object
 2   age                39900 non-null  float64
 3   hypertension       39900 non-null  int64
 4   heart_disease      39900 non-null  bool
 5   ever_married       39900 non-null  object
 6   work_type          39900 non-null  object
 7   Residence_type     39900 non-null  object
 8   avg_glucose_level  39900 non-null  float64
 9   bmi                38574 non-null  float64
 10  smoking_status     27668 non-null  object
 11  stroke             39900 non-null  int64
dtypes: bool(1), float64(3), int64(2), object(6)
memory usage: 3.4+ MB

In [31]:
df1.shape

(1000, 12)

In [32]:
#concat -

# pd.concat([s1, s2])

df_all = pd.concat([df1, df2, df3], axis = 0)
df_all.shape

(43400, 12)

In [33]:
df_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 43400 entries, 0 to 39899
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 43400 non-null  object
 1   gender             43400 non-null  object
 2   age                43400 non-null  float64
 3   hypertension       43400 non-null  int64
 4   heart_disease      43400 non-null  bool
 5   ever_married       43400 non-null  object
 6   work_type          43400 non-null  object
 7   Residence_type     43400 non-null  object
 8   avg_glucose_level  43400 non-null  float64
 9   bmi                41938 non-null  float64
 10  smoking_status     30108 non-null  object
 11  stroke             43400 non-null  int64
dtypes: bool(1), float64(3), int64(2), object(6)
memory usage: 4.0+ MB

In [35]:
df_all.reset_index(drop=True, inplace=True)
df_all.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43400 entries, 0 to 43399
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 43400 non-null  object
 1   gender             43400 non-null  object
 2   age                43400 non-null  float64
 3   hypertension       43400 non-null  int64
 4   heart_disease      43400 non-null  bool
 5   ever_married       43400 non-null  object
 6   work_type          43400 non-null  object
 7   Residence_type     43400 non-null  object
 8   avg_glucose_level  43400 non-null  float64
 9   bmi                41938 non-null  float64
 10  smoking_status     30108 non-null  object
 11  stroke             43400 non-null  int64
dtypes: bool(1), float64(3), int64(2), object(6)
memory usage: 3.7+ MB